In [47]:
import pandas as pd
import numpy as np

In [8]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\manisha garg\appdata\local\programs\python\python37\lib\site-packages (1.2.0)

WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\manisha garg\appdata\local\programs\python\python37\python.exe -m pip install --upgrade pip' command.

In [48]:
df1 = pd.read_excel (r'C:\Users\Manisha Garg\Downloads\Monster scrapping (1).xlsx') #place "r" before the path string to address special character, such as '\'. Don't forget to put the file name at the end of the path + '.xlsx'
print (df1)

                        KIND  Unnamed: 1
0    wellness,_Sales.Busines         NaN
1    wellness,_Product.0Mana         NaN
2            wellness,_Legal         NaN
3    wellness,_Purchase.Logi         NaN
4    wellness,_Analytics.Bus         NaN
..                       ...         ...
164          agricultu_Legal         NaN
165             agricultu_IT         NaN
166  agricultu_Human.0Resour         NaN
167  agricultu_operations,ma         NaN
168  agricultu_Customer.0Ser         NaN

[169 rows x 2 columns]

In [49]:
df2 = pd.read_excel (r'C:\Users\Manisha Garg\Downloads\Monster scrapping (1).xlsx', sheet_name=df1['KIND'][0])
df2

,total jobs,Salaries,Qualifications,Experience
0,NaN,NaN,NaN,NaN
1,Search Results - 68,0-3Lakhs (31) 3Lakhs-6Lakhs (37) Not Spec...,Bachelor of Arts (B.A) (15) Bachelor of B...,0 - 1 Years (37) 1 - 2 Years (45) 2 - 5 Y...

In [50]:
df2.dtypes

total jobs        object
Salaries          object
Qualifications    object
Experience        object
dtype: object

In [51]:
df3=df1.copy()
df3 = df3.rename(columns={"Unnamed: 1": "Total jobs"})
df3

                        KIND  Total jobs
0    wellness,_Sales.Busines         NaN
1    wellness,_Product.0Mana         NaN
2            wellness,_Legal         NaN
3    wellness,_Purchase.Logi         NaN
4    wellness,_Analytics.Bus         NaN
..                       ...         ...
164          agricultu_Legal         NaN
165             agricultu_IT         NaN
166  agricultu_Human.0Resour         NaN
167  agricultu_operations,ma         NaN
168  agricultu_Customer.0Ser         NaN

[169 rows x 2 columns]

In [52]:
df3['Total jobs'][0] = df2['total jobs'][1]
df3

c:\users\manisha garg\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
c:\users\manisha garg\appdata\local\programs\python\python37\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

                        KIND           Total jobs
0    wellness,_Sales.Busines  Search Results - 68
1    wellness,_Product.0Mana                  NaN
2            wellness,_Legal                  NaN
3    wellness,_Purchase.Logi                  NaN
4    wellness,_Analytics.Bus                  NaN
..                       ...                  ...
164          agricultu_Legal                  NaN
165             agricultu_IT                  NaN
166  agricultu_Human.0Resour                  NaN
167  agricultu_operations,ma                  NaN
168  agricultu_Customer.0Ser                  NaN

[169 rows x 2 columns]

In [61]:
Salary1 = [0]*169
sal1 = df2['Salaries'][1]
sal1

'   0-3Lakhs (31)  3Lakhs-6Lakhs (37)  Not Specified (26)  6Lakhs-10Lakhs (18)  10Lakhs-15Lakhs (12)  15Lakhs-25Lakhs (7)  25Lakhs-* (7) Apply '

In [62]:
splits1 = sal1.split()
splits1[1]= int(splits)

'(31)'

In [64]:
Salary1[0]=splits1[1]
Salary1

['(31)',
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0]